---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.SecondaryEngagementParameterWarning
source: html/53f0a684-3415-7078-fdd0-1c9bbd0de765.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures.SecondaryEngagementParameterWarning Property

This is used to post warning. "Bar Engagement 2" has an incorrect value.

## Syntax (C#)
```csharp
public static FailureDefinitionId SecondaryEngagementParameterWarning { get; }
```